{
  "basics": {
    "name": "Kishore Sampath",
    "label": "Graduate Student Researcher",
    "image": "",
    "email": "sampath.ki@northeastern.edu",
    "phone": "(857) 891-4581",
    "url": "https://www.linkedin.com/in/s-kishore/",
    "summary": "A German-born theoretical physicist, widely ranked among the greatest and most influential scientists of all time",
    "location": {
      "address": "2712 Broadway St",
      "postalCode": "CA 94115",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "AlbertEinstein",
        "url": "https://twitter.com/AlbertEinstein"
      }
    ]
  },
  "work": [
    {
      "name": "Khoury College of Computer Sciences, Northeastern University",
      "position": "Graduate Student Researcher",
      "url": "https://example.com",
      "startDate": "2024-03-01",
      "endDate": "Present",
      "summaryPoints": [
        "Researched and developed a multimodal, multi-label fair classifier for clinical decision-making tasks using EHR data.",
        "Implemented a radiology report generation pipeline by integrating a custom Faster R-CNN object detection model with Mistral 7B Instruct, achieving 10% higher accuracy and 23% improved coherence over benchmarks.",
        "Developed a novel multimodal architecture leveraging MedBERT to unify embeddings across 7 modalities, employing self-attention for cross-modal fusion to achieve an F1 score of 0.93.",
        "Architected a heterogeneous bagging approach for bias mitigation across intersectional demographic groups, resulting in a 6% improvement in demographic parity while preserving model utility."
      ]
    },
    {
      "name": "Khoury College of Computer Sciences, Northeastern University",
      "position": "Graduate Teaching Assistant | CS 5100 - Foundations of Artificial Intelligence",
      "url": "https://example.com",
      "startDate": "2024-01-01",
      "endDate": "Present",
      "summaryPoints": [
        "Developed assignments focused on de-biasing techniques and building trustworthy DL models through adversarial training, explaining Black-box ML models through SHAP and Knowledge Distillation for Image classification.",
        "Guided 500+ students through key concepts in Search & Constraint Satisfaction problems, Reinforcement Learning, Markov Decision Processes, Variational Autoencoders, Generative Adversarial Networks, and Transformers."
      ]
    },
    {
      "name": "Indian Institute of Technology, Madras",
      "position": "Full Stack Data Scientist",
      "url": "https://example.com",
      "startDate": "2021-05-01",
      "endDate": "2023-07-01",
      "summaryPoints": [
        "Developed and deployed an end-to-end NLP-based Customer Research Analysis tool with automated sentence tagging, reducing transcript processing time by 80%.",
        "Designed a Context-aware Sentence Tagging module utilizing Zero-Shot Text classification with the BART Large MNLI model to accurately tag sentences based on user-defined keywords.",
        "Conducted A/B testing to evaluate tagging strategies, achieving an 18% improvement in user satisfaction scores.",
        "Built a data-driven application to optimize induction furnace operations using advanced analytics, collaborating with key stakeholders to ensure alignment with operational goals.",
        "Developed an Insights module for exploratory data analysis based on a Tableau POC and an Analytics module for training machine learning models on furnace operational data, resulting in a 66% productivity gain for the client."
      ]
    }
  ],
  "education": [
    {
      "institution": "Khoury College of Computer Sciences, Northeastern University",
      "location": "Boston, MA, USA",
      "url": "https://www.uzh.ch/",
      "area": "Artificial Intelligence",
      "studyType": "Master of Science",
      "startDate": "2023-09-06",
      "endDate": "2025-05-01",
      "score": "3.8",
      "courses": [
        "Machine Learning",
        "Unsupervised Machine Learning and Data Mining",
        "Foundations of Artificial Intelligence",
        "Ethics & Bias Implications in AI",
        "Deep Learning",
        "Machine Learning Operations (MLOps)",
        "Algorithms",
        "Masters Project"
      ]
    },
    {
      "institution": "SRM Institute of Science and Technology",
      "location": "Chennai, TN, India",
      "url": "https://www.uzh.ch/",
      "area": "Mechanical Engineering",
      "studyType": "Bachelor of Technology",
      "startDate": "2016-08-01",
      "endDate": "2020-05-31",
      "score": "",
      "courses": [
        "Calculus and Solid Geometry",
        "Advanced Calculus and Complex Analysis",
        "Calculus of Variations and Non-Linear Programming",
        "Partial Differential Equations",
        "Probability and Statistics",
        "Fourier series",
        "Neural Networks and Fuzzy systems"
      ]
    }
  ],
  "awards": [
    {
      "title": "Performance Based Merit Scholarship",
      "date": "2019-01-01",
      "awarder": "SRM Institute of Science and Technology",
      "url": "https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/",
      "summary": "Awarded a performance-based merit scholarship for exceptional academic performance in 2019."
    },
    {
      "title": "First Rank in University Examinations",
      "date": "2019-01-02",
      "awarder": "SRM Institute of Science and Technology",
      "url": "https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/",
      "summary": "Secured First rank in the Department of Mechanical Engineering at the University examinations held in 2019."
    },
    {
      "title": "First Place, Overall Proficiency",
      "date": "2020-01-01",
      "awarder": "SRM Institute of Science and Technology",
      "url": "https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/",
      "summary": "Received the First place award for overall proficiency in the Department of Mechanical Engineering, SRM Institute of Science and Technology."
    },
    {
      "title": "Rising Star - 2021",
      "date": "2021-12-01",
      "awarder": "GITAA Private Limited - (IIT-M Incubated Startup)",
      "url": "https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/",
      "summary": "Awarded the ”Rising Star - 2021” for exceptional performance at GITAA Pvt Ltd."
    }
  ],
  "publications": [
    {
      "name": "Fairness at Every Intersection: Uncovering and Mitigating Intersectional Biases in Multimodal Clinical Predictions",
      "publisher": "Arxiv Pre-print",
      "releaseDate": "2024-11-30",
      "url": "https://arxiv.org/html/2412.00606v1",
      "summary": "This paper addresses the issue of intersectional biases in EHR-based clinical decision-making by examining how multiple demographic attributes interact to create disparate outcomes. The authors benchmark these biases on the MIMIC-Eye1 and MIMIC-IV ED datasets, leveraging pre-trained clinical LMs (MedBERT, Clinical BERT, Clinical BioBERT) to learn unified text representations from multimodal sources. Their proposed sub-group-specific mitigation approach demonstrates robustness across various datasets, subgroups, and embeddings, effectively tackling intersectional biases in complex EHR settings."
    }
  ],
  "skills": [
    {
      "name": "Physics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Quantum Mechanics",
        "Quantum Computing",
        "Quantum Information",
        "Quantum Cryptography",
        "Quantum Communication",
        "Quantum Teleportation"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Full professional proficiency",
      "icon": ""
    },
    {
      "language": "Tamil",
      "fluency": "Native or bilingual proficiency",
      "icon": ""
    },
    {
      "language": "Hindi",
      "fluency": "Elementary proficiency",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Research Interests",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Statistical Machine Learning",
        "Deep Generative Modeling",
        "Multimodal Learning",
        "Deep Learning",
        "Natural Language Processing",
        "Computer Vision"
      ]
    }
  ],
  "references": [
    {
      "name": "Aman Pandey - Undergrad Teammate",
      "icon": "fa-solid fa-laptop",
      "reference": "Kishore is one of the most hard working people I know. I have witnessed his passion for data science and mathematics while working on a project with him. He is a person who strives for perfection and does any work however hard it may seem with great zeal and enthusiasm. I can without a doubt say that Kishore has the ability to transform any work environment he is in with his shear perseverance and the passion he carries for his work. - Excerpt from LinkedIn Recommendations"
    }
  ],
  "projects": [
    {
      "name": "Curriculum Compass: A RAG Chatbot for Personalized Course Guidance",
      "summaryPoints": [
        "Engineered a Hybrid-RAG system utilizing dual retrieval strategies with cross-encoder re-ranking for retrieving course and review data, implementing query guard-rails to enhance accuracy and safety for course recommendations.",
        "Supervised fine-tuned Qwen2.5 0.5B using QLoRA on 2.5K synthetic instructions generated via Llama3 7B, achieving notable improvements in n-gram evaluation and LLM-as-a-judge metrics, enhancing overall retrieval and generation.",
        "Incorporated a multi-agentic workflow by combining query validation, intent analysis, dynamic retrieval, context analysis, and generation, leveraging advanced prompt-engineering and LLM feedback loops for optimized solutions.",
        "Automated data, model training and drift detection pipelines with Apache Airflow on GCP through Cloud Composer and BigQuery. Implemented LLM tracing with Weights & Biases and data/model registry on Huggingface Hub."
      ],
      "startDate": "2018-01-01",
      "endDate": "2018-01-01",
      "url": "https://example.com"
    },
    {
      "name": "Multimodal Meme Classification with Enhanced CLIP}",
      "summaryPoints": [
        "Architected a multi-modal classification system using CLIP with feature adapters and cosine classifiers, optimizing meme classification performance on the PrideMM dataset.",
        "Implemented a novel Semantic-Aware initialization strategy to enhance embedding separation, achieving 76.06% and 80.27% accuracy, with AUC scores of 84.52% and 85.59% for humor and hate detection respectively."
      ],
      "startDate": "2018-01-01",
      "endDate": "2018-01-01",
      "url": "https://example.com"
    },
    {
      "name": "ML Olympiad - Autism Prediction Challenge",
      "summaryPoints": [
        "Developed a high-performing two-level stacking ensemble classifier combining XGBoost, LightGBM, CatBoost, and Random Forest classifiers as base estimators with a final Logistic Regression model.",
        "Resolved the unbalanced data problem using SMOTE and trained the model with stratified k-fold cross-validation, optimizing hyperparameters via a Bayesian tuning framework to achieve a test set AUC-ROC score of 0.943."
      ],
      "startDate": "2022-02-01",
      "endDate": "2022-03-01",
      "url": ""
    },
    {
      "name": "Evolving Machine Unlearning: Benchmarking with Real-World Facial Datasets",
      "summaryPoints": [
        "Benchmarked machine unlearning methods on the MUFAC dataset, by implementing Knowledge Distillation based SCRUB and NegGrad from scratch to achieve 88% retain set accuracy and reducing forget set accuracy to 66%.",
        "Engineered comprehensive privacy evaluation framework incorporating three Membership Inference Attack approaches (LiRA, Loss-based, Classifier-based), achieving membership detection rates of 40.13% (LiRA)."
      ],
      "startDate": "2018-01-01",
      "endDate": "2018-01-01",
      "url": "https://example.com"
    }
  ]
}